# Imports (compatible for Python 2 and Python 3)

In [1]:
try:
    import urllib2 as ulib
except ImportError:
    import urllib3 as ulib

try:
    from StringIO import BytesIO as io
except ImportError:
    from io import BytesIO as io

try:
    from urllib import urlencode as urlencode
except ImportError:
    from urllib.parse import urlencode as urlencode
    
try:
    from urllib import urlopen as urlopen
except ImportError:
    from urllib.request import urlopen as urlopen
    
try:
    from urllib2 import HTTPError as HTTPError
except ImportError:
    from urllib.error import HTTPError as HTTPError

import ast
import pandas as pd

In [2]:
API_URL = 'https://fb55.carto.com:443/api/v2/sql?q='

def queryCartoDB(query, formatting = 'CSV', source = API_URL):
    '''queries carto datasets from a given carto account
    Arguments: 
    query - string: a valid sql query string
    format - outlut format  OPTIONAL (default CSV)
    source - a valid sql api endpoint OPTIONAL (default carto fb55 account)
    Returns:
    the return of the sql query AS A STRING
    NOTES:
    designed for the carto API, tested only with CSV return format'''
    
    
    data = urlencode({'format': formatting, 'q': query}).encode("utf-8")
    try:
        response = urlopen(source, data)
        return response.read()
    except HTTPError as e:
        raise (ValueError('\n'.join(ast.literal_eval(e.readline())['error'])))
        
def get_data(query):
    try:
        return pd.read_csv(io(queryCartoDB(query)), sep = ',')
    except ValueError as v:
        print (str(v))

In [3]:
query = '''SELECT * FROM fb55.citibike; '''
table = get_data(query)
table.head(5)

,the_geom,start_station_name,the_geom_webmercator,field_1,start_station_longitude,tripduration,starttime,stoptime,start_station_id,cartodb_id,start_station_latitude,end_station_id,end_station_name,end_station_latitude,end_station_longitude,bikeid,usertype,birth_year,gender
0,NaN,E 20 St & Park Ave,NaN,175,-73.987520,1090,2015-02-01 01:23:00+00,2015-02-01 01:42:00+00,503,107,40.738274,229,Great Jones St,40.727434,-73.993790,19718,Subscriber,1961.0,1
1,NaN,W 43 St & 10 Ave,NaN,1159,-73.994618,682,2015-02-01 10:55:00+00,2015-02-01 11:07:00+00,515,1088,40.760094,490,8 Ave & W 33 St,40.751551,-73.993934,21501,Subscriber,1981.0,1
2,NaN,E 6 St & Avenue B,NaN,2827,-73.981854,751,2015-02-01 13:59:00+00,2015-02-01 14:11:00+00,317,2759,40.724537,466,W 25 St & 6 Ave,40.743954,-73.991449,14788,Subscriber,1990.0,1
3,NaN,E 12 St & 3 Ave,NaN,4961,-73.988900,272,2015-02-01 17:28:00+00,2015-02-01 17:32:00+00,483,4893,40.732233,345,W 13 St & 6 Ave,40.736494,-73.997044,16219,Subscriber,1961.0,1
4,NaN,W 41 St & 8 Ave,NaN,6156,-73.990026,240,2015-02-01 21:36:00+00,2015-02-01 21:40:00+00,477,6090,40.756405,490,8 Ave & W 33 St,40.751551,-73.993934,18266,Customer,NaN,0

## Sort by start_station_id (ascending) and tripduration (descending):

In [4]:
query = '''
SELECT * FROM fb55.citibike 
ORDER BY start_station_id ASC, tripduration DESC;
'''

table = get_data(query)
table.head()

,the_geom,start_station_name,the_geom_webmercator,field_1,start_station_longitude,tripduration,starttime,stoptime,start_station_id,cartodb_id,start_station_latitude,end_station_id,end_station_name,end_station_latitude,end_station_longitude,bikeid,usertype,birth_year,gender
0,NaN,W 52 St & 11 Ave,NaN,9115,-73.993929,2099,2015-02-03 10:28:00+00,2015-02-03 11:02:00+00,72,9054,40.767272,328,Watts St & Greenwich St,40.724055,-74.009660,18653,Subscriber,1966.0,2
1,NaN,W 52 St & 11 Ave,NaN,2051,-73.993929,1944,2015-02-01 12:39:00+00,2015-02-01 13:12:00+00,72,1983,40.767272,328,Watts St & Greenwich St,40.724055,-74.009660,17849,Customer,NaN,0
2,NaN,W 52 St & 11 Ave,NaN,40355,-73.993929,1914,2015-02-07 09:49:00+00,2015-02-07 10:21:00+00,72,40341,40.767272,328,Watts St & Greenwich St,40.724055,-74.009660,21520,Subscriber,1966.0,2
3,NaN,W 52 St & 11 Ave,NaN,12996,-73.993929,1801,2015-02-04 06:32:00+00,2015-02-04 07:02:00+00,72,12938,40.767272,328,Watts St & Greenwich St,40.724055,-74.009660,15161,Subscriber,1959.0,2
4,NaN,W 52 St & 11 Ave,NaN,11359,-73.993929,1678,2015-02-03 18:21:00+00,2015-02-03 18:49:00+00,72,11298,40.767272,79,Franklin St & W Broadway,40.719116,-74.006667,21500,Subscriber,1964.0,1

## Select last 10 records of the table (use table's main id field):

In [5]:
query = '''
SELECT * FROM fb55.citibike
ORDER BY cartodb_id DESC
LIMIT 10;
'''

table = get_data(query)
table.head()

,the_geom,start_station_name,the_geom_webmercator,field_1,start_station_longitude,tripduration,starttime,stoptime,start_station_id,cartodb_id,start_station_latitude,end_station_id,end_station_name,end_station_latitude,end_station_longitude,bikeid,usertype,birth_year,gender
0,NaN,E 4 St & 2 Ave,NaN,46199,-73.989780,917,2015-02-07 23:59:00+00,2015-02-08 00:15:00+00,439,46200,40.726281,417,Barclay St & Church St,40.712912,-74.010202,20998,Subscriber,1965,2
1,NaN,Carmine St & 6 Ave,NaN,46198,-74.002150,548,2015-02-07 23:58:00+00,2015-02-08 00:08:00+00,368,46199,40.730386,334,W 20 St & 7 Ave,40.742388,-73.997262,19540,Subscriber,1983,2
2,NaN,5 Ave & E 29 St,NaN,46197,-73.986831,392,2015-02-07 23:57:00+00,2015-02-08 00:03:00+00,474,46198,40.745168,325,E 19 St & 3 Ave,40.736245,-73.984738,15545,Subscriber,1986,1
3,NaN,5 Ave & E 29 St,NaN,46196,-73.986831,428,2015-02-07 23:57:00+00,2015-02-08 00:04:00+00,474,46197,40.745168,325,E 19 St & 3 Ave,40.736245,-73.984738,16395,Subscriber,1986,2
4,NaN,W 20 St & 8 Ave,NaN,46195,-74.000040,689,2015-02-07 23:57:00+00,2015-02-08 00:08:00+00,470,46196,40.743453,325,E 19 St & 3 Ave,40.736245,-73.984738,15585,Subscriber,1953,1

## List all unique birth years (hint: distinct):

In [6]:
query = '''
SELECT DISTINCT birth_year FROM fb55.citibike;
'''

table = get_data(query)
table.head()

   birth_year  Unnamed: 1
0      1994.0         NaN
1      1954.0         NaN
2      1979.0         NaN
3      1956.0         NaN
4      1943.0         NaN

## Find minimal, maximal and average trip duration

In [7]:
query = '''
SELECT MIN(tripduration), MAX(tripduration), AVG(tripduration) 
FROM fb55.citibike;
'''

table = get_data(query)
table

   min    max         avg
0   60  43016  675.865823

## Select trips that started at 1am:

In [8]:
query = '''
SELECT starttime FROM fb55.citibike
WHERE EXTRACT(HOUR FROM starttime::time) =  1
ORDER BY starttime DESC;
'''
# ordered descending to see that only time between 1am and 2am are extracted
table = get_data(query)
table.head()

                starttime  Unnamed: 1
0  2015-02-07 01:58:00+00         NaN
1  2015-02-07 01:58:00+00         NaN
2  2015-02-07 01:55:00+00         NaN
3  2015-02-07 01:55:00+00         NaN
4  2015-02-07 01:55:00+00         NaN

## Find average birth year of people that ride bikes at 2am

In [9]:
query = '''
SELECT AVG(birth_year) FROM fb55.citibike
WHERE EXTRACT(HOUR FROM starttime::time) = 2
'''

table = get_data(query)
table

           avg  Unnamed: 1
0  1978.201754         NaN

## Age of oldest person riding at 3am

In [10]:
query = '''
SELECT MAX(2018-birth_year) FROM fb55.citibike
WHERE EXTRACT(HOUR FROM starttime::time) = 3;
'''

table = get_data(query)
table

   max  Unnamed: 1
0   78         NaN

## Aggregation: find the start station id that has the highest number of bikes taken from it

In [11]:
query = '''
SELECT start_station_id, COUNT(bikeid) as bikes FROM fb55.citibike
GROUP BY start_station_id
ORDER BY bikes DESC
LIMIT 1;
'''

table = get_data(query)
table

# or you can sort by using MAX OR table.head(1)! both works

   start_station_id  bikes
0               521    530

## Show top 3 end station id with largest total trip duration:

In [12]:
query = '''
SELECT end_station_id, SUM(tripduration) FROM fb55.citibike
GROUP BY end_station_id
ORDER BY sum DESC;
'''

table = get_data(query)
table.head(3)

   end_station_id     sum
0             477  395161
1             521  355829
2             318  320525

## Find start station id with shortest trip duration during 1am:

In [13]:
query = '''
SELECT start_station_id, tripduration
FROM fb55.citibike
WHERE EXTRACT(HOUR FROM starttime::time) = 1
ORDER BY tripduration ASC
LIMIT 1;
'''

table = get_data(query)
table

   start_station_id  tripduration
0               316            77